/*++ NDK Version: 0098
Copyright (c) Alex Ionescu.  All rights reserved.
Header Name:
    pstypes.h
Abstract:
    Type definitions for the Process Manager
Author:
    Alex Ionescu (alexi@tinykrnl.org) - Updated - 27-Feb-2006
--*/

#ifndef _PSTYPES_H
#define _PSTYPES_H

#ifndef STATUS_ASSERTION_FAILURE
#define STATUS_ASSERTION_FAILURE  0xC0000420
#endif

#ifndef STATUS_FAILURE
#define STATUS_FAILURE   0x80000000
#endif

#define ROUND_UP(VALUE,ROUND) ((ULONG)(((ULONG)VALUE + ((ULONG)ROUND - 1L)) & (~((ULONG)ROUND - 1L))))
#define ROUND_SIZE  ROUND_UP

#define NtCurrentPeb() (NtCurrentTeb()->ProcessEnvironmentBlock)
#define RtlGetProcessHeap() (NtCurrentPeb()->ProcessHeap)

//#define WH_MIN -1
#define WH_MAX 14
#define WH_MINHOOK WH_MIN
#define WH_MAXHOOK WH_MAX
#define NB_HOOKS (WH_MAXHOOK-WH_MINHOOK+1)

#define RPL_MASK                                0x0003
#define MODE_MASK                               0x0001
#define KGDT_R0_CODE                            (0x8)
#define KGDT_R0_DATA                            (0x10)
#define KGDT_R3_CODE                            (0x18)
#define KGDT_R3_DATA                            (0x20)
#define KGDT_TSS                                (0x28)
#define KGDT_R0_PCR                             (0x30)
#define KGDT_R3_TEB                             (0x38)
#define KGDT_LDT                                (0x48)
#define KGDT_DF_TSS                             (0x50)
#define KGDT_NMI_TSS                            (0x58)

//

    PowerState_QueryApps = 2,
    PowerState_QueryServices = 3,
    PowerState_QueryAppsFailed = 4,
    PowerState_QueryServicesFailed = 5,
    PowerState_SuspendApps = 6,
    PowerState_SuspendServices = 7,
    PowerState_ShowUI = 8,
    PowerState_NotifyWL = 9,
    PowerState_ResumeApps = 10,
    PowerState_ResumeServices = 11,
    PowerState_UnBlockSessionSwitch = 12,
    PowerState_End = 13,
    PowerState_BlockInput = 14,
    PowerState_UnblockInput = 15,
} POWERSTATETASK;

//
// Win32K Job Callback Types
//
typedef enum _PSW32JOBCALLOUTTYPE
{
   PsW32JobCalloutSetInformation = 0,
   PsW32JobCalloutAddProcess = 1,
   PsW32JobCalloutTerminate = 2,
} PSW32JOBCALLOUTTYPE;

//
// Win32K Thread Callback Types
//
typedef enum _PSW32THREADCALLOUTTYPE
{
    PsW32ThreadCalloutInitialize,
    PsW32ThreadCalloutExit,
} PSW32THREADCALLOUTTYPE;

//
// Declare empty structure definitions so that they may be referenced by
// routines before they are defined
//
struct _W32THREAD;
struct _W32PROCESS;
struct _ETHREAD;
struct _WIN32_POWEREVENT_PARAMETERS;
struct _WIN32_POWERSTATE_PARAMETERS;
struct _WIN32_JOBCALLOUT_PARAMETERS;
struct _WIN32_OPENMETHOD_PARAMETERS;
struct _WIN32_OKAYTOCLOSEMETHOD_PARAMETERS;
struct _WIN32_CLOSEMETHOD_PARAMETERS;
struct _WIN32_DELETEMETHOD_PARAMETERS;
struct _WIN32_PARSEMETHOD_PARAMETERS;

//
// Win32K Process and Thread Callbacks
//
typedef
NTSTATUS
(NTAPI *PKWIN32_PROCESS_CALLOUT)(
    struct _EPROCESS *Process,
    BOOLEAN Create
);

typedef
NTSTATUS
(NTAPI *PKWIN32_THREAD_CALLOUT)(
    struct _ETHREAD *Thread,
    PSW32THREADCALLOUTTYPE Type
);

typedef
NTSTATUS
(NTAPI *PKWIN32_GLOBALATOMTABLE_CALLOUT)(
    VOID
);

typedef
NTSTATUS
(NTAPI *PKWIN32_POWEREVENT_CALLOUT)(
    struct _WIN32_POWEREVENT_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_POWERSTATE_CALLOUT)(
    struct _WIN32_POWERSTATE_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_JOB_CALLOUT)(
    struct _WIN32_JOBCALLOUT_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PGDI_BATCHFLUSH_ROUTINE)(
    VOID
);

typedef
NTSTATUS
(NTAPI *PKWIN32_OPENMETHOD_CALLOUT)(
    struct _WIN32_OPENMETHOD_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_OKTOCLOSEMETHOD_CALLOUT)(
    struct _WIN32_OKAYTOCLOSEMETHOD_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_CLOSEMETHOD_CALLOUT)(
    struct _WIN32_CLOSEMETHOD_PARAMETERS *Parameters
);

typedef
VOID
(NTAPI *PKWIN32_DELETEMETHOD_CALLOUT)(
    struct _WIN32_DELETEMETHOD_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_PARSEMETHOD_CALLOUT)(
    struct _WIN32_PARSEMETHOD_PARAMETERS *Parameters
);

typedef
NTSTATUS
(NTAPI *PKWIN32_WIN32DATACOLLECTION_CALLOUT)(
    struct _EPROCESS *Process,
    PVOID Callback,
    PVOID Context
);

//
// Lego Callback
//
typedef
VOID
(NTAPI *PLEGO_NOTIFY_ROUTINE)(
    IN PKTHREAD Thread
);

#endif

typedef NTSTATUS
(NTAPI *PPOST_PROCESS_INIT_ROUTINE)(
    VOID
);

//
// Descriptor Table Entry Definition
//
#define _DESCRIPTOR_TABLE_ENTRY_DEFINED
typedef struct _DESCRIPTOR_TABLE_ENTRY
{
    ULONG Selector;
    LDT_ENTRY Descriptor;
} DESCRIPTOR_TABLE_ENTRY, *PDESCRIPTOR_TABLE_ENTRY;

//
// PEB Lock Routine
//
typedef VOID
(NTAPI *PPEBLOCKROUTINE)(
    PVOID PebLock
);

//
// PEB Free Block Descriptor
//
typedef struct _PEB_FREE_BLOCK
{
    struct _PEB_FREE_BLOCK* Next;
    ULONG Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

typedef struct _PEB_LDR_DATA
{
     ULONG Length;
     UCHAR Initialized;
     PVOID SsHandle;
     LIST_ENTRY InLoadOrderModuleList;
     LIST_ENTRY InMemoryOrderModuleList;
     LIST_ENTRY InInitializationOrderModuleList;
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct _LDR_DATA_TABLE_ENTRY{
     LIST_ENTRY InLoadOrderLinks;
     LIST_ENTRY InMemoryOrderLinks;
     LIST_ENTRY InInitializationOrderLinks;
     PVOID DllBase;
     PVOID EntryPoint;
     ULONG SizeOfImage;
     UNICODE_STRING FullDllName;
     UNICODE_STRING BaseDllName;
     ULONG Flags;
     WORD LoadCount;
     WORD TlsIndex;
     union{
          LIST_ENTRY HashLinks;
          struct{
               PVOID SectionPointer;
               ULONG CheckSum;
          };
     }U1;
     union{
          ULONG TimeDateStamp;
          PVOID LoadedImports;
     }U2;
     struct _ACTIVATION_CONTEXT * EntryPointActivationContext;
     PVOID PatchInformation;
     LIST_ENTRY ForwarderLinks;
     LIST_ENTRY ServiceTagLinks;
     LIST_ENTRY StaticLinks;
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

//
// Current Directory Structures
//
typedef struct _CURDIR{
  UNICODE_STRING DosPath;
  HANDLE Handle;
} CURDIR, *PCURDIR;

typedef struct _RTL_DRIVE_LETTER_CURDIR{
  USHORT Flags;
  USHORT Length;
  ULONG TimeStamp;
  UNICODE_STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

//
// Structures for RtlCreateUserProcess
//
typedef struct _RTL_USER_PROCESS_PARAMETERS{
  ULONG MaximumLength;
  ULONG Length;
  ULONG Flags;
  ULONG DebugFlags;
  HANDLE ConsoleHandle;
  ULONG ConsoleFlags;
  HANDLE StandardInput;
  HANDLE StandardOutput;
  HANDLE StandardError;
  CURDIR CurrentDirectory;
  UNICODE_STRING DllPath;
  UNICODE_STRING ImagePathName;
  UNICODE_STRING CommandLine;
  PWSTR Environment;
  ULONG StartingX;
  ULONG StartingY;
  ULONG CountX;
  ULONG CountY;
  ULONG CountCharsX;
  ULONG CountCharsY;
  ULONG FillAttribute;
  ULONG WindowFlags;
  ULONG ShowWindowFlags;
  UNICODE_STRING WindowTitle;
  UNICODE_STRING DesktopInfo;
  UNICODE_STRING ShellInfo;
  UNICODE_STRING RuntimeData;
  RTL_DRIVE_LETTER_CURDIR CurrentDirectories[32];
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

typedef struct _SYSTEM_BASIC_INFORMATION
{
    ULONG Reserved;
    ULONG TimerResolution;
    ULONG PageSize;
    ULONG NumberOfPhysicalPages;
    ULONG LowestPhysicalPageNumber;
    ULONG HighestPhysicalPageNumber;
    ULONG AllocationGranularity;
    ULONG_PTR MinimumUserModeAddress;
    ULONG_PTR MaximumUserModeAddress;
    ULONG_PTR ActiveProcessorsAffinityMask;
    CCHAR NumberOfProcessors;
} SYSTEM_BASIC_INFORMATION, *PSYSTEM_BASIC_INFORMATION;

typedef struct _SYSTEM_PROCESSOR_INFORMATION{
    USHORT ProcessorArchitecture;
    USHORT ProcessorLevel;
    USHORT ProcessorRevision;
    USHORT Reserved;
    ULONG ProcessorFeatureBits;
} SYSTEM_PROCESSOR_INFORMATION, *PSYSTEM_PROCESSOR_INFORMATION;

typedef struct _SYSTEM_TIMEOFDAY_INFORMATION
{
  LARGE_INTEGER BootTime;
  LARGE_INTEGER CurrentTime;
  LARGE_INTEGER TimeZoneBias;
  ULONG TimeZoneId;
  ULONG Reserved;
#if (NTDDI_VERSION >= NTDDI_WIN2K)
  ULONGLONG BootTimeBias;
  ULONGLONG SleepTimeBias;
#endif
} SYSTEM_TIMEOFDAY_INFORMATION, *PSYSTEM_TIMEOFDAY_INFORMATION;

typedef enum _SYSTEM_INFORMATION_CLASS{
    SystemBasicInformation,
    SystemProcessorInformation,
    SystemPerformanceInformation,
    SystemTimeOfDayInformation,
    SystemPathInformation, /// Obsolete: Use KUSER_SHARED_DATA
    SystemProcessInformation,
    SystemCallCountInformation,
    SystemDeviceInformation,
    SystemProcessorPerformanceInformation,
    SystemFlagsInformation,
    SystemCallTimeInformation,
    SystemModuleInformation,
    SystemLocksInformation,
    SystemStackTraceInformation,
    SystemPagedPoolInformation,
    SystemNonPagedPoolInformation,
    SystemHandleInformation,
    SystemObjectInformation,
    SystemPageFileInformation,
    SystemVdmInstemulInformation,
    SystemVdmBopInformation,
    SystemFileCacheInformation,
    SystemPoolTagInformation,
    SystemInterruptInformation,
    SystemDpcBehaviorInformation,
    SystemFullMemoryInformation,
    SystemLoadGdiDriverInformation,
    SystemUnloadGdiDriverInformation,
    SystemTimeAdjustmentInformation,
    SystemSummaryMemoryInformation,
    SystemMirrorMemoryInformation,
    SystemPerformanceTraceInformation,
    SystemObsolete0,
    SystemExceptionInformation,
    SystemCrashDumpStateInformation,
    SystemKernelDebuggerInformation,
    SystemContextSwitchInformation,
    SystemRegistryQuotaInformation,
    SystemExtendServiceTableInformation,
    SystemPrioritySeperation,
    SystemPlugPlayBusInformation,
    SystemDockInformation,
    SystemPowerInformationNative,
    SystemProcessorSpeedInformation,
    SystemCurrentTimeZoneInformation,
    SystemLookasideInformation,
    SystemTimeSlipNotification,
    SystemSessionCreate,
    SystemSessionDetach,
    SystemSessionInformation,
    SystemRangeStartInformation,
    SystemVerifierInformation,
    SystemAddVerifier,
    SystemSessionProcessesInformation,
    SystemLoadGdiDriverInSystemSpaceInformation,
    SystemNumaProcessorMap,
    SystemPrefetcherInformation,
    SystemExtendedProcessInformation,
    SystemRecommendedSharedDataAlignment,
    SystemComPlusPackage,
    SystemNumaAvailableMemory,
    SystemProcessorPowerInformation,
    SystemEmulationBasicInformation,
    SystemEmulationProcessorInformation,
    SystemExtendedHanfleInformation,
    SystemLostDelayedWriteInformation,
    SystemBigPoolInformation,
    SystemSessionPoolTagInformation,
    SystemSessionMappedViewInformation,
    SystemHotpatchInformation,
    SystemObjectSecurityMode,
    SystemWatchDogTimerHandler,
    SystemWatchDogTimerInformation,
    SystemLogicalProcessorInformation,
    SystemWo64SharedInformationObosolete,
    SystemRegisterFirmwareTableInformationHandler,
    SystemFirmwareTableInformation,
    SystemModuleInformationEx,
    SystemVerifierTriageInformation,
    SystemSuperfetchInformation,
    SystemMemoryListInformation,
    SystemFileCacheInformationEx,
    SystemThreadPriorityClientIdInformation,
    SystemProcessorIdleCycleTimeInformation,
    SystemVerifierCancellationInformation,
    SystemProcessorPowerInformationEx,
    SystemRefTraceInformation,
    SystemSpecialPoolInformation,
    SystemProcessIdInformation,
    SystemErrorPortInformation,
    SystemBootEnvironmentInformation,
    SystemHypervisorInformation,
    SystemVerifierInformationEx,
    SystemTimeZoneInformation,
    SystemImageFileExecutionOptionsInformation,
    SystemCoverageInformation,
    SystemPrefetchPathInformation,
    SystemVerifierFaultsInformation,
    MaxSystemInfoClass,
} SYSTEM_INFORMATION_CLASS;

typedef struct _NLS_USER_INFO
{
  WCHAR iCountry[80];
  WCHAR sCountry[80];
  WCHAR sList[80];
  WCHAR iMeasure[80];
  WCHAR iPaperSize[80];
  WCHAR sDecimal[80];
  WCHAR sThousand[80];
  WCHAR sGrouping[80];
  WCHAR iDigits[80];
  WCHAR iLZero[80];
  WCHAR iNegNumber[80];
  WCHAR sNativeDigits[80];
  WCHAR iDigitSubstitution[80];
  WCHAR sCurrency[80];
  WCHAR sMonDecSep[80];
  WCHAR sMonThouSep[80];
  WCHAR sMonGrouping[80];
  WCHAR iCurrDigits[80];
  WCHAR iCurrency[80];
  WCHAR iNegCurr[80];
  WCHAR sPosSign[80];
  WCHAR sNegSign[80];
  WCHAR sTimeFormat[80];
  WCHAR s1159[80];
  WCHAR s2359[80];
  WCHAR sShortDate[80];
  WCHAR sYearMonth[80];
  WCHAR sLongDate[80];
  WCHAR iCalType[80];
  WCHAR iFirstDay[80];
  WCHAR iFirstWeek[80];
  WCHAR sLocale[80];
  WCHAR sLocaleName[85];
  LCID UserLocaleId;
  LUID InteractiveUserLuid;
  CHAR InteractiveUserSid[68]; // SECURITY_MAX_SID_SIZE to make ros happy
  ULONG ulCacheUpdateCount;
} NLS_USER_INFO, *PNLS_USER_INFO;

typedef struct _KSYSTEM_TIME {
  ULONG LowPart;
  LONG High1Time;
  LONG High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME;

typedef struct _BASE_STATIC_SERVER_DATA
{
  UNICODE_STRING WindowsDirectory;
  UNICODE_STRING WindowsSystemDirectory;
  UNICODE_STRING NamedObjectDirectory;
  USHORT WindowsMajorVersion;
  USHORT WindowsMinorVersion;
  USHORT BuildNumber;
  USHORT CSDNumber;
  USHORT RCNumber;
  WCHAR CSDVersion[128];
  SYSTEM_BASIC_INFORMATION SysInfo;
  SYSTEM_TIMEOFDAY_INFORMATION TimeOfDay;
  PVOID IniFileMapping;
  NLS_USER_INFO NlsUserInfo;
  BOOLEAN DefaultSeparateVDM;
  BOOLEAN IsWowTaskReady;
  UNICODE_STRING WindowsSys32x86Directory;
  BOOLEAN fTermsrvAppInstallMode;
  TIME_ZONE_INFORMATION tziTermsrvClientTimeZone;
  KSYSTEM_TIME ktTermsrvClientBias;
  ULONG TermsrvClientTimeZoneId;
  BOOLEAN LUIDDeviceMapsEnabled;
  ULONG TermsrvClientTimeZoneChangeNum;
} BASE_STATIC_SERVER_DATA, *PBASE_STATIC_SERVER_DATA;

typedef struct _STATIC_SERVER_DATA//cambia en 64 bits
{
  PVOID Unknown;
  PBASE_STATIC_SERVER_DATA BaseStaticServerData;
  PVOID MultipleUnknown[4];//ni idea...
} STATIC_SERVER_DATA, *PSTATIC_SERVER_DATA;
//
// Process Environment Block (PEB)
//
typedef struct _PEB
{
    UCHAR InheritedAddressSpace;
    UCHAR ReadImageFileExecOptions;
    UCHAR BeingDebugged;
#if (NTDDI_VERSION >= NTDDI_LONGHORN)
    union
    {
        struct
        {
            UCHAR ImageUsesLargePages:1;
            UCHAR IsProtectedProcess:1;
            UCHAR IsLegacyProcess:1;
            UCHAR IsImageDynamicallyRelocated:1;
            UCHAR SkipPatchingUser32Forwarders:1;
            UCHAR SpareBits:3;
        };
        UCHAR BitField;
    };
#else
    BOOLEAN SpareBool;
#endif
    HANDLE Mutant;
    PVOID ImageBaseAddress;
    PPEB_LDR_DATA Ldr;
    PRTL_USER_PROCESS_PARAMETERS ProcessParameters;
    PVOID SubSystemData;
    PVOID ProcessHeap;
#if (NTDDI_VERSION >= NTDDI_LONGHORN)
    struct _RTL_CRITICAL_SECTION *FastPebLock;
    PVOID AltThunkSListPtr;
    PVOID IFEOKey;
    union
    {
        struct
        {
            ULONG ProcessInJob:1;
            ULONG ProcessInitializing:1;
            ULONG ProcessUsingVEH:1;
            ULONG ProcessUsingVCH:1;
            ULONG ReservedBits0:28;
        };
        ULONG CrossProcessFlags;
    };
    union
    {
        PVOID* KernelCallbackTable;
        PVOID UserSharedInfoPtr;
    };
    ULONG SystemReserved[1];
    ULONG SpareUlong;
    ULONG SparePebPtr0;
#else
    PVOID FastPebLock;
    PPEBLOCKROUTINE FastPebLockRoutine;
    PPEBLOCKROUTINE FastPebUnlockRoutine;
    ULONG EnvironmentUpdateCount;
    PVOID* KernelCallbackTable;
    PVOID EventLogSection;
    PVOID EventLog;
    PPEB_FREE_BLOCK FreeList;
#endif
    ULONG TlsExpansionCounter;
    PVOID TlsBitmap;
    ULONG TlsBitmapBits[0x2];
    PVOID ReadOnlySharedMemoryBase;
#if (NTDDI_VERSION >= NTDDI_LONGHORN)
    PVOID HotpatchInformation;
#else
    PVOID ReadOnlySharedMemoryHeap;
#endif
    PSTATIC_SERVER_DATA ReadOnlyStaticServerData;
    PVOID AnsiCodePageData;
    PVOID OemCodePageData;
    PVOID UnicodeCaseTableData;
    ULONG NumberOfProcessors;
    ULONG NtGlobalFlag;
    LARGE_INTEGER CriticalSectionTimeout;
    ULONG HeapSegmentReserve;
    ULONG HeapSegmentCommit;
    ULONG HeapDeCommitTotalFreeThreshold;
    ULONG HeapDeCommitFreeBlockThreshold;
    ULONG NumberOfHeaps;
    ULONG MaximumNumberOfHeaps;
    PVOID* ProcessHeaps;
    PVOID GdiSharedHandleTable;
    PVOID ProcessStarterHelper;
    ULONG GdiDCAttributeList;
#if (NTDDI_VERSION >= NTDDI_LONGHORN)
    struct _RTL_CRITICAL_SECTION *LoaderLock;
#else
    PVOID LoaderLock;
#endif
    ULONG OSMajorVersion;
    ULONG OSMinorVersion;
    USHORT OSBuildNumber;
    USHORT OSCSDVersion;
    ULONG OSPlatformId;
    ULONG ImageSubSystem;
    ULONG ImageSubSystemMajorVersion;
    ULONG ImageSubSystemMinorVersion;
    ULONG ImageProcessAffinityMask;
    ULONG GdiHandleBuffer[0x22];
    PPOST_PROCESS_INIT_ROUTINE PostProcessInitRoutine;
    struct _RTL_BITMAP *TlsExpansionBitmap;
    ULONG TlsExpansionBitmapBits[0x20];
    ULONG SessionId;
#if (NTDDI_VERSION >= NTDDI_WINXP)
    ULARGE_INTEGER AppCompatFlags;
    ULARGE_INTEGER AppCompatFlagsUser;
    PVOID pShimData;
    PVOID AppCompatInfo;
    UNICODE_STRING CSDVersion;
    struct _ACTIVATION_CONTEXT_DATA *ActivationContextData;
    struct _ASSEMBLY_STORAGE_MAP *ProcessAssemblyStorageMap;
    struct _ACTIVATION_CONTEXT_DATA *SystemDefaultActivationContextData;
    struct _ASSEMBLY_STORAGE_MAP *SystemAssemblyStorageMap;
    ULONG MinimumStackCommit;
#endif
#if (NTDDI_VERSION >= NTDDI_WS03)
    PVOID *FlsCallback;
    LIST_ENTRY FlsListHead;
    struct _RTL_BITMAP *FlsBitmap;
    ULONG FlsBitmapBits[4];
    ULONG FlsHighIndex;
#endif
#if (NTDDI_VERSION >= NTDDI_LONGHORN)
    PVOID WerRegistrationData;
    PVOID WerShipAssertPtr;
#endif
} PEB, *PPEB;

//
// GDI Batch Descriptor
//
typedef struct _GDI_TEB_BATCH
{
    ULONG Offset;
    HANDLE HDC;
    ULONG Buffer[0x136];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH;

//
// Initial TEB
//
typedef struct _INITIAL_TEB{
   ULONG StackCommit;
   ULONG StackReserve;
   PVOID StackBase;
   PVOID StackLimit;
   PVOID StackAllocate;
} INITIAL_TEB, *PINITIAL_TEB;

//
// TEB Active Frame Structures
//
typedef struct _TEB_ACTIVE_FRAME_CONTEXT
{
    ULONG Flags;
    LPSTR FrameName;
} TEB_ACTIVE_FRAME_CONTEXT, *PTEB_ACTIVE_FRAME_CONTEXT;

typedef struct _TEB_ACTIVE_FRAME
{
    ULONG Flags;
    struct _TEB_ACTIVE_FRAME *Previous;
    PTEB_ACTIVE_FRAME_CONTEXT Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME;

typedef LRESULT(CALLBACK * 	HOOKPROC )(int, WPARAM, LPARAM);
//typedef LRESULT (*WNDPROC)(HWND, long, WPARAM, LPARAM);

typedef struct tagWnd{
  WNDPROC  lpfnWndProc;
  int      style;
  long     backGround;
  long     titleMsg;
  long     extra;
} WND, *PWND;

typedef struct _HOOK *PHOOK;

typedef struct _DESKTOPINFO
{
/* 000 */ PVOID        pvDesktopBase;
/* 004 */ PVOID        pvDesktopLimit;
/* 008 */ PWND         spwnd;
/* 00c */ DWORD        fsHooks;
/* 010 */ PHOOK        aphkStart[NB_HOOKS];
/* 050 */ PWND         spwndShell;
/* 054 */ PVOID ppiShellProcess;
/* 058 */ PWND         spwndBkGnd;
/* 05c */ PWND         spwndTaskman;
/* 060 */ PWND         spwndProgman;
/* 064 */ PVOID        pvwplShellHook;
/* 068 */ INT          cntMBox;
} DESKTOPINFO, *PDESKTOPINFO;

typedef struct _DESKTOP  // Size: 0x88
{                                          // XP
#if (_WIN32_WINNT >= 0x0501)
  DWORD              dwSessionId;          // 000
#endif
  PDESKTOPINFO       pDeskInfo;            // 004
  PVOID       pDispInfo;            // 008
  struct _DESKTOP   *rpdeskNext;           // 00c
  PVOID     rpwinstaParent;       // 010
  DWORD              dwDTFlage;            // 014
  DWORD              dwDesktopId;          // 018
  PWND               spwndMenu;            // 01c
  PVOID              spmenuSys;            // 020
  PVOID              spmenuDialogSys;      // 024
  PVOID              spmenuHScroll;        // 028
  PVOID              spmenuVScroll;        // 02c
  PWND               spwndForeground;      // 030
  PWND               spwndTray;            // 034
  PWND               spwndMessage;         // 038
  PWND               spwndTooltip;         // 03c
  HANDLE             hsectionDesktop;      // 040
  PVOID         pheapDesktop;         // 044
  DWORD              dwConsoleThreadId;    // 048
  DWORD              dwConsoleIMEThreadId; // 04c
  PVOID cciConsole;           // 050 Size is 20 bytes
  LIST_ENTRY         PtiList;              // 064
  PWND               spwndTrack;           // 06c
  DWORD              htEx;                 // 070
  RECT               rcMouseHover;         // 074
  DWORD              dwMouseHoverTime;     // 084
#if (_WIN32_WINNT <= 0x0500)
  DWORD              dwSessionId; // W2k
#endif
} DESKTOP, *PDESKTOP;

typedef struct _THREADINFO *PTHREADINFO;

typedef struct _HOOK {
  ULONG hHook;
  ULONG cLockObj;
  PTHREADINFO *pti;
  ULONG rpdesk;
  ULONG pSelf;
  struct _HOOK *phkNext;
  int iHook;
  HOOKPROC offPfn;
  unsigned int flags;
  int ihmod;
  PTHREADINFO *ptiHooked;
  PDESKTOP rpdesk2;
} HOOK;

typedef struct tagHOOKTABLE
{
  LIST_ENTRY Hooks[NB_HOOKS];
  UINT       Counts[NB_HOOKS];
} HOOKTABLE, *PHOOKTABLE;

typedef struct _USER_MESSAGE
{
  LIST_ENTRY ListEntry;
  BOOLEAN FreeLParam;
  MSG Msg;
} USER_MESSAGE, *PUSER_MESSAGE;

struct _USER_MESSAGE_QUEUE;
//typedef FARPROC SENDASYNCPROC;

typedef struct _USER_SENT_MESSAGE
{
  LIST_ENTRY ListEntry;
  MSG Msg;
  PKEVENT CompletionEvent;
  LRESULT* Result;
  struct _USER_MESSAGE_QUEUE* SenderQueue;
  SENDASYNCPROC CompletionCallback;
  ULONG_PTR CompletionCallbackContext;
  LIST_ENTRY DispatchingListEntry;
  INT HookMessage;
} USER_SENT_MESSAGE, *PUSER_SENT_MESSAGE;

typedef struct _THRDCARETINFO
{
    HWND hWnd;
    HBITMAP Bitmap;
    POINT Pos;
    SIZE Size;
    BYTE Visible;
    BYTE Showing;
} THRDCARETINFO, *PTHRDCARETINFO;

typedef struct _USER_MESSAGE_QUEUE
{
  LONG References;
  struct _ETHREAD *Thread;
  LIST_ENTRY SentMessagesListHead;
  LIST_ENTRY PostedMessagesListHead;
  LIST_ENTRY NotifyMessagesListHead;
  LIST_ENTRY HardwareMessagesListHead;
  LIST_ENTRY TimerListHead;
  KMUTEX HardwareLock;
  PUSER_MESSAGE MouseMoveMsg;
  BOOLEAN QuitPosted;
  ULONG QuitExitCode;
  PKEVENT NewMessages;
  HANDLE NewMessagesHandle;
  ULONG LastMsgRead;
  HWND FocusWindow;
  ULONG PaintCount;
  HWND ActiveWindow;
  HWND CaptureWindow;
  HWND MoveSize;
  HWND MenuOwner;
  BYTE MenuState;
  PTHRDCARETINFO CaretInfo;
  PHOOKTABLE Hooks;
  WORD WakeMask;
  WORD QueueBits;
  WORD ChangedBits;
  LPARAM ExtraInfo;
  LIST_ENTRY DispatchingMessagesHead;
  LIST_ENTRY LocalDispatchingMessagesHead;
  struct _DESKTOP_OBJECT *Desktop;
} USER_MESSAGE_QUEUE, *PUSER_MESSAGE_QUEUE;

typedef struct _TL
{
    struct _TL* next;
    PVOID pobj;
    PVOID pfnFree;
} TL, *PTL;

typedef struct _W32THREAD
{
    PETHREAD pEThread;
    ULONG RefCount;
    PTL ptlW32;
    PVOID pgdiDcattr;
    PVOID pgdiBrushAttr;
    PVOID pUMPDObjs;
    PVOID pUMPDHeap;
    DWORD dwEngAcquireCount;
    PVOID pSemTable;
    PVOID pUMPDObj;
} W32THREAD, *PW32THREAD;

typedef struct _W32PROCESSINFO
{
    PVOID UserHandleTable;
    HANDLE hUserHeap;
    PVOID UserHeapDelta;
    PVOID hModUser;
    PVOID LocalClassList;
    PVOID GlobalClassList;
    PVOID SystemClassList;
    PVOID psi;
} W32PROCESSINFO, *PW32PROCESSINFO;


typedef struct _W32THREADINFO
{
    W32PROCESSINFO pi; /* [USER] */
    W32PROCESSINFO kpi; /* [KERNEL] */
    PDESKTOPINFO pDeskInfo;
    ULONG Hooks;
    PVOID ClientThreadInfo;
} W32THREADINFO, *PW32THREADINFO;

typedef struct _CALLBACKWND{
  HWND hWnd;
  struct _WND *pWnd;
  PVOID pActCtx;
} CALLBACKWND, *PCALLBACKWND;

typedef struct _CLIENTINFO{
  ULONG_PTR CI_flags;
  ULONG_PTR cSpins;
  DWORD dwExpWinVer;
  DWORD dwCompatFlags;
  DWORD dwCompatFlags2;
  DWORD dwTIFlags;
  PDESKTOPINFO pDeskInfo;
  ULONG_PTR ulClientDelta;
  PHOOK phkCurrent;
  DWORD fsHooks;
  CALLBACKWND CallbackWnd;
  DWORD dwHookCurrent;
  INT cInDDEMLCallback;
  PVOID pClientThreadInfo;
  ULONG_PTR dwHookData;
  DWORD dwKeyCache;
  BYTE afKeyState[8];
  DWORD dwAsyncKeyCache;
  BYTE afAsyncKeyState[8];
  BYTE afAsyncKeyStateRecentDow[8];
  HKL hKL;
  WORD CodePage;
  BYTE achDbcsCF[2];
  MSG msgDbcsCB;
}CLIENTINFO,*PCLIENTINFO;

typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME{
  struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME *Previous;
  struct _ACTIVATION_CONTEXT *ActivationContext;
  ULONG Flags;
} RTL_ACTIVATION_CONTEXT_STACK_FRAME, *PRTL_ACTIVATION_CONTEXT_STACK_FRAME;

typedef struct _ACTIVATION_CONTEXT_STACK{
  ULONG Flags;
  ULONG NextCookieSequenceNumber;
  RTL_ACTIVATION_CONTEXT_STACK_FRAME *ActiveFrame;
  LIST_ENTRY FrameListCache;
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;

//
// Thread Environment Block (TEB)
//
typedef struct _TEB
{
    NT_TIB Tib;                           //0x000
    PVOID EnvironmentPointer;             //0x01c
    CLIENT_ID ClientId;                   //0x020
    PVOID ActiveRpcHandle;                //0x028
    PVOID ThreadLocalStoragePointer;      //0x02C
    struct _PEB *ProcessEnvironmentBlock; //0x030
    ULONG LastErrorValue;                 //0x034
    ULONG CountOfOwnedCriticalSections;   //0x038
    PVOID CsrClientThread;                //0x03C
    PW32THREADINFO Win32ThreadInfo;   //0x040
    ULONG User32Reserved[0x1A];           //0x044
    ULONG UserReserved[5];
    PVOID WOW32Reserved;
    LCID CurrentLocale;
    ULONG FpSoftwareStatusRegister;
    PVOID SystemReserved1[0x36];
    LONG ExceptionCode;
    PACTIVATION_CONTEXT_STACK ActivationContextStackPointer;
#ifdef _WIN64
    UCHAR SpareBytes1[24];
#else
    UCHAR SpareBytes1[0x24];
#endif
    ULONG TxFsContext;
    GDI_TEB_BATCH GdiTebBatch;
    CLIENT_ID RealClientId;
    PVOID GdiCachedProcessHandle;
    ULONG GdiClientPID;
    ULONG GdiClientTID;
    PVOID GdiThreadLocalInfo;
    SIZE_T Win32ClientInfo[62];
    PVOID glDispatchTable[0xE9];
    SIZE_T glReserved1[0x1D];
    PVOID glReserved2;
    PVOID glSectionInfo;
    PVOID glSection;
    PVOID glTable;
    PVOID glCurrentRC;
    PVOID glContext;
    NTSTATUS LastStatusValue;
    UNICODE_STRING StaticUnicodeString;
    WCHAR StaticUnicodeBuffer[0x105];
    PVOID DeallocationStack;
    PVOID TlsSlots[0x40];
    LIST_ENTRY TlsLinks;
    PVOID Vdm;
